### pandas 칼럼명 추출 및 변경

In [1]:
import pandas as pd
df = pd.DataFrame({'a':[1,2,3], 'b':[4,5,6]})

In [2]:
df

   a  b
0  1  4
1  2  5
2  3  6

In [4]:
df.columns # column명 얻기

Index(['a', 'b'], dtype='object')

In [6]:
df.columns[1]

'b'

문제 1. colunm명 b를 c로 바꾸시오.

In [7]:
df.columns = ['a','c']

In [8]:
df

   a  c
0  1  4
1  2  5
2  3  6

문제 2. rename을 사용해서 필드명 'a'를 '에이'로 변경하시오.

In [9]:
df.rename(columns={'a':'에이'}, inplace=True) # inplace=True는 원본 데이터프레임이 바로 변경되며, 새로운 데이터프레임을 생성하지 않는다.

In [10]:
df

   에이  c
0   1  4
1   2  5
2   3  6

문제 3. '에이' 열을 추출하시오.

In [12]:
df['에이']

0    1
1    2
2    3
Name: 에이, dtype: int64

In [13]:
type(df['에이'])

pandas.core.series.Series

### Record : 데이터의 행
### Column 또는 Field : 해당 데이터의 속성을 나타내는 열

In [24]:
import pandas as pd
df = pd.DataFrame({
    'a' : [1, 1, 3, 4, 5],
    'b' : [2, 3, 2, 3, 4],
    'c' : [3, 4, 7, 6, 4]
})

In [25]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

문제1. 1, 3, 6, 4, 8로 이루어진 'd' column을 추가해보자.

In [26]:
df['d'] = [1, 3, 6, 4, 8]
df

   a  b  c  d
0  1  2  3  1
1  1  3  4  3
2  3  2  7  6
3  4  3  6  4
4  5  4  4  8

문제2. 1, 1, 1, 1, 1로 이루어진 'e' column을 추가해보자.

In [27]:
df['e'] = 1
df

   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1

In [19]:
df.dtypes

a    int64
b    int64
c    int64
d    int64
e    int64
dtype: object

문제3. a + b - c의 결과로 이루어진 f 칼럼을 추가해보자.

In [28]:
df['f'] = df['a'] + df['b'] - df['c']
df

   a  b  c  d  e  f
0  1  2  3  1  1  0
1  1  3  4  3  1  0
2  3  2  7  6  1 -2
3  4  3  6  4  1  1
4  5  4  4  8  1  5

문제4. column 'd', 'e', 'f'를 삭제해보자.

In [29]:
df.drop(['d', 'e', 'f'], axis=1, inplace=True) # 열 방향으로 삭제하기 위해서 axis=1 작성

In [30]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

문제5. a에는 6, b에는 7, c에는 8을 추가해보자.
- ._append는 데이터프레임의 메소드이며, 합칠 데이터프레임의 형태가 같아야 한다

In [34]:
df = df._append({'a':6, 'b':7, 'c':8}, ignore_index=True) # ignore_index=True는 새로운 행의 인덱스가 중복되지 않도록 자동으로 생성

In [35]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  6  7  8

문제6. 다른 방법으로 a에는 7, b에는 8, c에는 9를 추가해보자. (loc 사용)

In [36]:
df.loc[6] = [7,8,9]

In [37]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  7  8  9

문제7. 첫 번째에서 네 번째 레코드를 삭제해보자.

In [40]:
df.drop(df.index[:4], inplace=True)

In [41]:
df

   a  b  c
4  5  4  4
5  6  7  8
6  7  8  9